{
    "goal": "SDG 7: Affordable and Clean Energy",
    "overview": "SDG Goal 7 aims to ensure access to affordable, reliable, sustainable, and modern energy for all. Energy is essential for nearly every major aspect of development, from economic growth to healthcare, education, and the fight against climate change. This goal recognizes that energy systems must evolve to support human well-being while protecting the planet.",
    "progress": "Progress on these goals leads to a ripple effect of positive outcomes: healthier communities, stronger economies, and a more resilient planet. By aligning efforts with the SDGs, we can pave the way for a better future—one where every person has the opportunity to thrive. Join us in supporting the SDGs and becoming part of a global movement for change. Together, we can make a difference.",
    "key targets": [
      {
        "title": "1. Universal Access to Energy",
        "description": "By 2030, ensure that everyone has access to affordable, reliable, and modern energy services, especially in underdeveloped and rural areas."
      },
      {
        "title": "2. Increase Renewable Energy",
        "description": "Substantially grow the share of renewable energy in the global energy mix, including solar, wind, hydro, and bioenergy sources."
      },
      {
        "title": "3. Energy Efficiency Improvements",
        "description": "Double the rate of improvement in energy efficiency to reduce energy demand and greenhouse gas emissions while boosting productivity."
      },
      {
        "title": "4. Access to Research and Technology",
        "description": "Enhance international cooperation to support research, technology, and investment in clean energy infrastructure, particularly in developing countries."
      },
      {
        "title": "5. Expand Infrastructure",
        "description": "Strengthen infrastructure and technology to provide sustainable energy to underserved populations."
      }
    ],
    "youtubeEmbedLink": "https://www.youtube.com/embed/jwYtCAUT0cc?si=sSXKCBON7SdRTTGp"
  }